In [41]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\xnosp\desktop\estudos\faculdade\quinto periodo\ia\cursopython\venv\lib\site-packages (2.0.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\xnosp\desktop\estudos\faculdade\quinto periodo\ia\cursopython\venv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\xnosp\desktop\estudos\faculdade\quinto periodo\ia\cursopython\venv\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\xnosp\desktop\estudos\faculdade\quinto periodo\ia\cursopython\venv\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\xnosp\desktop\estudos\faculdade\quinto periodo\ia\cursopython\venv\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\xnosp\desktop\estudos\faculdade\quinto periodo\ia\cursopython\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [45]:
import numpy as np
import pandas as pd

In [47]:
#normal
#df = pd.DataFrame([['a','b','c'],[1,2,3]])
#dicionario
#df = pd.DataFrame({'a':[1,2,3],'b':[5,6,7]})
#passando valores do nampy
#df = pd.DataFrame(np.random.randn(3,2))
df = pd.DataFrame(np.random.randint(1,10,6).reshape(2,3),
                  columns=['Cruzeiro', 'Atletico', 'America'],
                 index= ['Gols', 'Vitorias'])
df

          Cruzeiro  Atletico  America
Gols             7         7        9
Vitorias         9         1        7

**Seleção de Dados**

In [48]:
df['Atletico']

Gols        7
Vitorias    1
Name: Atletico, dtype: int32

In [49]:
df['Cruzeiro']['Vitorias']

9

In [15]:
df.Cruzeiro

Gols        1
Vitorias    1
Name: Cruzeiro, dtype: int32

In [16]:
df

          Cruzeiro  Atletico  America
Gols             1         8        3
Vitorias         1         1        8

In [17]:
df.loc['Vitorias']

Cruzeiro    1
Atletico    1
America     8
Name: Vitorias, dtype: int32

In [18]:
df.loc[['Vitorias'],['Atletico','America']]

          Atletico  America
Vitorias         1        8

In [20]:
df.iloc[1]

Cruzeiro    1
Atletico    1
America     8
Name: Vitorias, dtype: int32

In [21]:
df.iloc[0,1:3]

Atletico    8
America     3
Name: Gols, dtype: int32

**Adicição e Remoção de Linhas e Colunas no DataFrame**

In [22]:
df['Flamengo']= [3,17]

In [23]:
df

          Cruzeiro  Atletico  America  Flamengo
Gols             1         8        3         3
Vitorias         1         1        8        17

In [24]:
df.loc['Empates']=[0,0,0,50]
df

          Cruzeiro  Atletico  America  Flamengo
Gols             1         8        3         3
Vitorias         1         1        8        17
Empates          0         0        0        50

In [25]:
#axis coluna =1, axis linha=0;
df.drop('America', axis=1)

          Cruzeiro  Atletico  Flamengo
Gols             1         8         3
Vitorias         1         1        17
Empates          0         0        50

In [26]:
df

          Cruzeiro  Atletico  America  Flamengo
Gols             1         8        3         3
Vitorias         1         1        8        17
Empates          0         0        0        50

In [27]:
df.drop('America', axis=1,inplace=True)

In [28]:
df

          Cruzeiro  Atletico  Flamengo
Gols             1         8         3
Vitorias         1         1        17
Empates          0         0        50

In [29]:
del df['Cruzeiro']

In [30]:
df

          Atletico  Flamengo
Gols             8         3
Vitorias         1        17
Empates          0        50

In [32]:
df.drop('Empates',axis=0,inplace=True)

In [33]:
df

          Atletico  Flamengo
Gols             8         3
Vitorias         1        17

In [51]:
df2 = pd.DataFrame({'a':[1,1,np.nan],'b':[5,2,7],'c':[5,6,np.nan]})
df2

     a  b    c
0  1.0  5  5.0
1  1.0  2  6.0
2  NaN  7  NaN

In [35]:
df2.dropna()

     a  b    c
0  1.0  5  5.0
1  2.0  6  6.0

In [52]:
df2.drop_duplicates(subset=['a'])

     a  b    c
0  1.0  5  5.0
2  NaN  7  NaN

In [37]:
df2.fillna('Gustavo')

         a  b        c
0      1.0  5      5.0
1      2.0  6      6.0
2  Gustavo  7  Gustavo

In [38]:
df2.fillna(value=df2['b'].mean())

     a  b    c
0  1.0  5  5.0
1  2.0  6  6.0
2  6.0  7  6.0